In [79]:
import pandas as pd
import numpy as np

In [80]:
df = pd.read_csv('Customers.csv')

In [81]:
df.head()

   age  income  gender m_status buys
0   25    high    male   single   no
1   25    high    male  married   no
2   35    high    male   single  yes
3   35  medium    male   single  yes
4   30     low  female   single  yes

In [82]:
income_dummies = pd.get_dummies(df['income']

SyntaxError: unexpected EOF while parsing (<ipython-input-82-740385af9558>, line 1)

In [83]:
income_dummies.head()

NameError: name 'income_dummies' is not defined

In [84]:
new_income = df.drop(['income'], axis = 1)

In [85]:
new_income.head()

   age  gender m_status buys
0   25    male   single   no
1   25    male  married   no
2   35    male   single  yes
3   35    male   single  yes
4   30  female   single  yes

In [86]:
df = pd.concat([new_income,income_dummies], axis=1)

NameError: name 'income_dummies' is not defined

In [87]:
df.head()

   age  income  gender m_status buys
0   25    high    male   single   no
1   25    high    male  married   no
2   35    high    male   single  yes
3   35  medium    male   single  yes
4   30     low  female   single  yes

In [88]:
gender_dummies = pd.get_dummies(df['gender'])

In [89]:
gender_dummies.head()

   female  male
0       0     1
1       0     1
2       0     1
3       0     1
4       1     0

In [90]:
new_gender = df.drop(['gender'], axis = 1)

In [91]:
new_gender.head()

   age  income m_status buys
0   25    high   single   no
1   25    high  married   no
2   35    high   single  yes
3   35  medium   single  yes
4   30     low   single  yes

In [92]:
df = pd.concat([new_gender,gender_dummies], axis = 1)

In [93]:
df.head()

   age  income m_status buys  female  male
0   25    high   single   no       0     1
1   25    high  married   no       0     1
2   35    high   single  yes       0     1
3   35  medium   single  yes       0     1
4   30     low   single  yes       1     0

In [94]:
m_status_dummies = pd.get_dummies(df['m_status'])

In [95]:
m_status_dummies.head()

   married  single
0        0       1
1        1       0
2        0       1
3        0       1
4        0       1

In [96]:
new_m_status = df.drop(['m_status'], axis = 1)

In [97]:
new_m_status.head()

   age  income buys  female  male
0   25    high   no       0     1
1   25    high   no       0     1
2   35    high  yes       0     1
3   35  medium  yes       0     1
4   30     low  yes       1     0

In [98]:
df = pd.concat([new_m_status,m_status_dummies], axis = 1 )

In [99]:
df.head()

   age  income buys  female  male  married  single
0   25    high   no       0     1        0       1
1   25    high   no       0     1        1       0
2   35    high  yes       0     1        0       1
3   35  medium  yes       0     1        0       1
4   30     low  yes       1     0        0       1

In [100]:
buys_gummies = pd.get_dummies(df['buys'])

In [101]:
buys_gummies.head()

   no  yes
0   1    0
1   1    0
2   0    1
3   0    1
4   0    1

In [102]:
new_buys = df.drop(['buys'], axis = 1)

In [103]:
df = pd.concat([new_buys,buys_gummies], axis = 1)

In [104]:
df.head()

   age  income  female  male  married  single  no  yes
0   25    high       0     1        0       1   1    0
1   25    high       0     1        1       0   1    0
2   35    high       0     1        0       1   0    1
3   35  medium       0     1        0       1   0    1
4   30     low       1     0        0       1   0    1

In [163]:
from sklearn.preprocessing import OrdinalEncoder

In [178]:
df = pd.read_csv('Customers.csv')

In [179]:
df.head()

   age  income  gender m_status buys
0   25    high    male   single   no
1   25    high    male  married   no
2   35    high    male   single  yes
3   35  medium    male   single  yes
4   30     low  female   single  yes

In [180]:
df.income.unique()

array(['high', 'medium', 'low'], dtype=object)

In [181]:
income_list = ['high', 'medium', 'low']

In [182]:
ordinal_income = OrdinalEncoder (categories=[income_list])

In [183]:
encodred_income_value = ordinal_income.fit_transform(df[['income']])

In [184]:
new_income = pd.DataFrame(encodred_income_value, columns =['income'])

In [185]:
new_income.head()

   income
0     0.0
1     0.0
2     0.0
3     1.0
4     2.0

In [186]:
df.income = new_income

In [187]:
df.head()

   age  income  gender m_status buys
0   25     0.0    male   single   no
1   25     0.0    male  married   no
2   35     0.0    male   single  yes
3   35     1.0    male   single  yes
4   30     2.0  female   single  yes

In [188]:
df.gender.unique()

array(['male', 'female'], dtype=object)

In [189]:
gender_list = ['male', 'female']

In [192]:
ordinal_gender = OrdinalEncoder (categories=[gender_list])

In [197]:
encodred_gender_value = ordinal_gender.fit_transform(df[['gender']])

In [198]:
new_gender = pd.DataFrame(encodred_income_value, columns =['gender'])

In [199]:
df.gender = new_gender

In [200]:
df.head()

   age  income  gender m_status buys
0   25     0.0     0.0   single   no
1   25     0.0     0.0  married   no
2   35     0.0     0.0   single  yes
3   35     1.0     1.0   single  yes
4   30     2.0     2.0   single  yes

In [201]:
df.m_status.unique()

array(['single', 'married'], dtype=object)

In [206]:
m_status_list = ['single', 'married']

In [207]:
ordinal_m_status = OrdinalEncoder(categories = [m_status_list])

In [211]:
encoder_m_status_value = ordinal_m_status.fit_transform(df[['m_status']])

In [212]:
new_m_status = pd.DataFrame(encoder_m_status_value,columns = ['m_status'])

In [213]:
df.m_status = new_m_status

In [214]:
df.head()

   age  income  gender  m_status buys
0   25     0.0     0.0       0.0   no
1   25     0.0     0.0       1.0   no
2   35     0.0     0.0       0.0  yes
3   35     1.0     1.0       0.0  yes
4   30     2.0     2.0       0.0  yes

In [220]:
df.buys.unique()

array(['no', 'yes'], dtype=object)

In [221]:
buys_lisT = ['no', 'yes']

In [225]:
ordinal_buys = OrdinalEncoder(categories = [buys_lisT])

In [226]:
encoder_buys_value = ordinal_buys.fit_transform(df[['buys']])

In [227]:
new_buys = pd.DataFrame(encoder_buys_value,columns=['buys'])

In [228]:
df.buys = new_buys

In [229]:
df.head()

   age  income  gender  m_status  buys
0   25     0.0     0.0       0.0   0.0
1   25     0.0     0.0       1.0   0.0
2   35     0.0     0.0       0.0   1.0
3   35     1.0     1.0       0.0   1.0
4   30     2.0     2.0       0.0   1.0

In [230]:
df = pd.read_csv('agora.csv')

In [231]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [ ]:
import category_encoder